src/InformationRegisters/РодственныеСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РодственныеСвязи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтепеньРодства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаконныйПредставитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийБонусныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийНакопительныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыДокументаЗаконногоПредставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Calltouch</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chat2Desk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CoMagic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenApi</Name>
					<Comment>WhatsApp</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Marquiz</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roistat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TapLink</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tilda</Name>
					<Comment>Ловец лидов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vkontakte</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VkontakteApi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Webhook</Name>
					<Comment>Получение лидов стандартный набор параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВиджетОнлайнЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЭМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтурСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложениеУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкиИОтзывы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроДокторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМетрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Лаборатория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховаяКомпания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорпоративныеКонтрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосОрган</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Потенциальный</Name>
					<Comment>Потенциальный клиент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Первичный</Name>
					<Comment>Новый пациент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВернувшийся</Name>
					<Comment>Невернувшийся пациент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постоянный</Name>
					<Comment>Постоянный клиент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/СтепеньРодства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтепеньРодства</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбратнаяСвязьМуж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтепеньРодства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбратнаяСвязьЖен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтепеньРодства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемПриходится</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/РодственныеСвязи/Forms/ФормаЗаписиБыстрая/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СозданиеИзСобытия") И Параметры.СозданиеИзСобытия = Истина Тогда
		
		Параметры.Свойство("ВыбранныйКлиент"	, Запись.Контрагент);
		Параметры.Свойство("Фамилия"			, ЭтотОбъект.Фамилия);
		Параметры.Свойство("Имя"				, ЭтотОбъект.Имя);
		Параметры.Свойство("Отчество"			, ЭтотОбъект.Отчество);
		Параметры.Свойство("ПолНовогоКлиента"	, ЭтотОбъект.ПолНовогоКлиента);
		Параметры.Свойство("ДатаРождения"		, ЭтотОбъект.ДатаРождения);
		Параметры.Свойство("НомерТелефона"		, ЭтотОбъект.Телефон);
		
		Элементы.Телефон.Доступность				 = Ложь;
		Элементы.СуществующийРодственник.Видимость	 = Ложь;
		
	КонецЕсли;
	
	СтепеньРодстваПредставление = Запись.СтепеньРодства.Наименование;
	 	
	Если Параметры.Свойство("Контрагент") И ЗначениеЗаполнено(Параметры.Контрагент) Тогда
		
		Запись.Контрагент = Параметры.Контрагент;
		
		Если НЕ ЗначениеЗаполнено(Параметры.Контрагент.ПолКлиента) 
			И Параметры.Свойство("ПолКонтрагента") 
			И ЗначениеЗаполнено(Параметры.ПолКонтрагента) Тогда
			ЭтотОбъект.ПолНовогоКлиента = Параметры.ПолКонтрагента;
		КонецЕсли;

	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Запись.Контрагент) и ЗначениеЗаполнено(Запись.Родственник) Тогда 
		Элементы.ГруппаУдалитьРодственника.Видимость = Истина;
		РодственникДоИзменения = Запись.Родственник;
	КонецЕсли;
	
	Если Параметры.Свойство("ВернутьСтруктуруСвязи") И ЗначениеЗаполнено(Параметры.ВернутьСтруктуруСвязи) Тогда
		ЭтаФорма.ВернутьСтруктуруСвязи = Параметры.ВернутьСтруктуруСвязи;
	КонецЕсли;
	
	Если Не Запись.Родственник.Ссылка.Пустая() ИЛИ (Параметры.ЗначенияЗаполнения.Свойство("Родственник") И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.Родственник)) Тогда
		ЭтотОбъект.СуществующийРодственник			  = Истина;
		Элементы.СуществующийРодственник.Доступность  = Ложь;
		Элементы.ГруппаСозданиеРодственника.Видимость = Ложь;
		Элементы.Родственник.Видимость				  = Истина;
		
		//// Для нормально работы создания родств. связей из Ф.Док. Событие
		// Если Параметры.ЗначенияЗаполнения.Свойство("Родственник") = Истина
		//	И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.Родственник) Тогда
		//	
		//		Запись.Родственник = Параметры.ЗначенияЗаполнения.Родственник;
		//	
		// КонецЕсли;
		//
		// Если Параметры.Свойство("ПолКонтрагента") = Истина
		//	И ЗначениеЗаполнено(Параметры.ПолКонтрагента) Тогда
		//	
		//		ПолНовогоКлиента = Параметры.ПолКонтрагента;
		//		
		// КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - При открытии.
//
Процедура ПриОткрытии(Отказ)
		
	УстановитьВидимостьПолейРодственника();

КонецПроцедуры


&НаКлиенте
// Процедура, обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ВыполнитьПроверкуПередЗаписью(Отказ);
	
	Если Не Отказ И Не СуществующийРодственник Тогда
		Запись.Родственник = СоздатьРодственника();
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура СохранитьРодственника(Команда)
	
	Если Записать() Тогда
		Оповестить("ОбновленаРодственнаяСвязь");
		Закрыть(Запись.Родственник);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура УдалитьРодственника(Команда)
	
	УдалитьРодственникаНаСервере();	
	Оповестить("ОбновленаРодственнаяСвязь");
	Закрыть();

КонецПроцедуры 

#КонецОбласти

#Область ОбработкаСобытийЭлементовФормы

&НаКлиенте
// Процедура - Степень родства начало выбора.
//
Процедура СтепеньРодстваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = ПолучитьСписокВыбораСтепенейРодства();
	Результат = Неопределено;

	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("СтепеньРодстваНачалоВыбораЗавершение", ЭтотОбъект), СписокВыбора, Элемент, СписокВыбора.НайтиПоЗначению(Запись.СтепеньРодства));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Степень родства начало выбора.
//
Процедура ОбратнаяСтепеньРодстваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Если НЕ ЗначениеЗаполнено(СтепеньРодстваПредставление) И НЕ ЗначениеЗаполнено(Запись.СтепеньРодства) Тогда Возврат; КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбораОбратный = ПолучитьСписокВыбораОбратныхСтепенейРодства(СтепеньРодстваПредставление);
	Результат = Неопределено;

	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ОбратнаяСтепеньРодстваНачалоВыбораЗавершение", ЭтотОбъект), СписокВыбораОбратный, Элемент, СписокВыбораОбратный.НайтиПоЗначению(ОбратнаяСтепеньРодства));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Существующий родственник при изменении.
//
Процедура СуществующийРодственникПриИзменении(Элемент)
	
	УстановитьВидимостьПолейРодственника();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, выполняет проверки перед записью.
//
Процедура ВыполнитьПроверкуПередЗаписью(Отказ)
	
	Если Не ЗначениеЗаполнено(Запись.СтепеньРодства) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не указана степень родства.';en='Degree of kinship is not specified.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.Родственник) И Запись.Контрагент = Запись.Родственник Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Клиент не может являться сам себе родственником!';en='Client cannot be a relative to myself!'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Запись.Контрагент, "ПолКлиента"))
		И НЕ ЗначениеЗаполнено(ЭтотОбъект.ПолНовогоКлиента) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru='У клиента %1 не заполнен пол. Определить обратную родственную связь нельзя.';en='Client %1 is not full gender. It is impossible to determine the inverse kinship.'"), Запись.Контрагент));	
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если СуществующийРодственник Тогда
		Если Не ЗначениеЗаполнено(ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Запись.Родственник, "ПолКлиента")) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru='У клиента %1 не заполнен пол. Определить обратную родственную связь нельзя.';en='Client %1 is not full gender. It is impossible to determine the inverse kinship.'"), Запись.Родственник));	
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	Иначе
		Если Не ЗначениеЗаполнено(ПолНовогоКлиента) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнен пол нового клиента. Определить обратную родственную связь нельзя.';en='Gender of new client is not specified. It is impossible to determine reverse relationship.'"));
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	ОбратнаяСтепеньРодства = Справочники.СтепеньРодства.ПолучитьОбратнуюСтепеньРодства(Запись.СтепеньРодства, ?(СуществующийРодственник, ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Запись.Родственник, "ПолКлиента"), ПолНовогоКлиента));
	Если Не ЗначениеЗаполнено(ОбратнаяСтепеньРодства) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='В настройках степени родства не указано обратное родство!';en='In the degrees kinship settings reverse kinship is not specified!'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,Перечисления.ТипыВнешнихСистем.ИЭМК, Истина);
	Если ЗначениеЗаполнено(ВнешняяСистема) И Запись.ЗаконныйПредставитель И Не ЗначениеЗаполнено(Запись.РеквизитыДокументаЗаконногоПредставителя) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='ИЭМК: У законного представителя не заполнены реквизиты документа определяющего право представлять пациента!';en='The legal representative has not filled out the requesits of the document defining the right to represent the patient!'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить список выбора степеней родства.
//
Функция ПолучитьСписокВыбораСтепенейРодства()
	
	СписокВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СтепеньРодства.Ссылка КАК Ссылка,
	               |	ПРЕДСТАВЛЕНИЕ(СтепеньРодства.Ссылка) КАК КемПриходится
	               |ИЗ
	               |	Справочник.СтепеньРодства КАК СтепеньРодства
	               |ГДЕ
	               |	СтепеньРодства.ПометкаУдаления = ЛОЖЬ";
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		СписокВыбора.Добавить(Результат.Ссылка, Результат.КемПриходится);
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить список выбора степеней родства.
//
Функция ПолучитьСписокВыбораОбратныхСтепенейРодства(ПрямаяРодственнаяСвязь)
	
	СписокВыбораОбратный = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СтепеньРодства.ОбратнаяСвязьМуж.Представление КАК ОбратнаяСвязьМужПредставление,
	               |	СтепеньРодства.ОбратнаяСвязьЖен.Представление КАК ОбратнаяСвязьЖенПредставление,
	               |	СтепеньРодства.ОбратнаяСвязьЖен.Ссылка КАК ОбратнаяСвязьЖенСсылка,
	               |	СтепеньРодства.ОбратнаяСвязьМуж.Ссылка КАК ОбратнаяСвязьМужСсылка
	               |ИЗ
	               |	Справочник.СтепеньРодства КАК СтепеньРодства
	               |ГДЕ
	               |	СтепеньРодства.ПометкаУдаления = ЛОЖЬ
	               |	И СтепеньРодства.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", ПрямаяРодственнаяСвязь);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	
	СписокВыбораОбратный.Добавить(Результат.ОбратнаяСвязьМужСсылка, ПрямаяРодственнаяСвязь+" / "+Результат.ОбратнаяСвязьМужПредставление);
	СписокВыбораОбратный.Добавить(Результат.ОбратнаяСвязьЖенСсылка, ПрямаяРодственнаяСвязь+" / "+Результат.ОбратнаяСвязьЖенПредставление);
	
	Возврат СписокВыбораОбратный;
	
КонецФункции

&НаКлиенте
// Процедура - Установить видимость полей родственника.
//
Процедура УстановитьВидимостьПолейРодственника()
	
	Элементы.ГруппаСозданиеРодственника.Видимость = Не СуществующийРодственник;
	Элементы.Родственник.Видимость				  = СуществующийРодственник;
	Элементы.РеквизитыДокументаЗаконногоПредставителя.Видимость = Запись.ЗаконныйПредставитель;

КонецПроцедуры

&НаКлиенте
// Процедура - Степень родства начало выбора завершение.
//
// Параметры:
//  ВыбранныйЭлемент		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура СтепеньРодстваНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Результат = ВыбранныйЭлемент;
	Если Результат <> Неопределено Тогда
	
		Запись.СтепеньРодства = Результат.Значение;
		СтепеньРодстваПредставление = Результат.Представление;
		
		// Если ЗначениеЗаполнено(ПолНовогоКлиента) Тогда // Подставим в поле обр. родств. связи подходящую обратную родственую связь (определяемую по полу)
		//	
		//	// Справочники.СтепеньРодства.ПолучитьОбратнуюСтепеньРодства(Запись.СтепеньРодства, Запись.Контрагент.ПолКлиента);
		//	
		//	СписокВыбораОбратный = ПолучитьСписокВыбораОбратныхСтепенейРодства(СтепеньРодстваПредставление);
		//	ОбратнаяСтепеньРодства = ?(ПолНовогоКлиента = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской"), СписокВыбораОбратный[0].Значение, СписокВыбораОбратный[1].Значение);
		//	ОбратнаяСтепеньРодстваПредставление = ?(ПолНовогоКлиента = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской"), СписокВыбораОбратный[0].Представление, СписокВыбораОбратный[1].Представление);
		//	
		// Иначе // Если не определен пол, но сбрасываем обр. родств. связь
		//	
		//	ОбратнаяСтепеньРодства = Неопределено;
		//	ОбратнаяСтепеньРодстваПредставление = Неопределено;
		//	
		// КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Степень родства начало выбора завершение.
//
// Параметры:
//  ВыбранныйЭлемент		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ОбратнаяСтепеньРодстваНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Результат = ВыбранныйЭлемент;
	Если Результат <> Неопределено Тогда
		ОбратнаяСтепеньРодства = Результат.Значение;
		ОбратнаяСтепеньРодстваПредставление = Результат.Представление;
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Функция, создает контрагента и возвращает ссылку на него.
//
Функция СоздатьРодственника()
	
	КлиентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	
	// Заполняем по умолчанию
	// Сотрудник регистрации, структурная единица, дата регистрации и прочее
	КлиентОбъект.Заполнить(Неопределено);
	
	КлиентОбъект.Фамилия  = Фамилия;
	КлиентОбъект.Имя      = Имя;
	КлиентОбъект.Отчество = Отчество;
	КлиентОбъект.ДатаРожденияКлиента = ДатаРождения;
	
	КлиентОбъект.Наименование	= КлиентОбъект.Фамилия + ?(ЗначениеЗаполнено(КлиентОбъект.Фамилия), " ", "") + КлиентОбъект.Имя + ?(ЗначениеЗаполнено(КлиентОбъект.Имя), " ", "") + КлиентОбъект.Отчество;
	КлиентОбъект.ТипКонтрагента	= Перечисления.ТипыКонтрагентов.Клиенты;
	КлиентОбъект.ЮрФизЛицо		= Перечисления.ЮрФизЛицо.ФизЛицо;
	
	КлиентОбъект.Родитель = Справочники.Контрагенты.ПолучитьПапкуПоТипу(Перечисления.ТипыКонтрагентов.Клиенты);
	
	Если Не ПустаяСтрока(Телефон) Тогда
		// Преобразовываем номер согласно региональных настроек
		ОжидаемыйТип = УправлениеКонтактнойИнформациейСлужебныйПовтИсп.ТипВидаКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ТелефонКлиента);
		ЗначенияПолей = Новый СписокЗначений;
		УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(Телефон, ЗначенияПолей);
		// Получаем значение для записи
		Значение = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(УправлениеКонтактнойИнформациейСлужебный.ДесериализацияТелефона(ЗначенияПолей, Телефон, ОжидаемыйТип));		
		// Помещаем КИ в объект
		УправлениеКонтактнойИнформациейСтоматология.ЗаписатьКонтактнуюИнформацию(КлиентОбъект, Значение, Справочники.ВидыКонтактнойИнформации.ТелефонКлиента, ОжидаемыйТип);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПолНовогоКлиента) Тогда
		
		ПолКлиентаСтрокой = ОбщегоНазначенияСтоматология.ОпределитьПолКлиента(КлиентОбъект.Фамилия, КлиентОбъект.Имя, КлиентОбъект.Отчество);
		Если ПолКлиентаСтрокой = "Мужской" Тогда
			ПолРодственника = Перечисления.ПолФизическогоЛица.Мужской;
		ИначеЕсли ПолКлиентаСтрокой = "Женский" Тогда
			ПолРодственника = Перечисления.ПолФизическогоЛица.Женский;
		КонецЕсли;
		
	КонецЕсли;
	
	КлиентОбъект.ПолКлиента = ПолНовогоКлиента;
	
	// создать запись в регистре статусов контрагентов
	КлиентОбъект.ДополнительныеСвойства.Вставить("Статус", Перечисления.СтатусыКонтрагентов.Потенциальный);
	
	КлиентОбъект.Записать();
	
	Возврат КлиентОбъект.Ссылка;	
	
КонецФункции

&НаСервере
// Процедура - Удалить родственника на сервере.
//
Процедура УдалитьРодственникаНаСервере()
		
	НаборЗаписей = РегистрыСведений.РодственныеСвязи.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(Запись.Контрагент);
	НаборЗаписей.Отбор.Родственник.Установить(РодственникДоИзменения);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаконныйПредставительПриИзменении(Элемент)
	
	УстановитьВидимостьПолейРодственника();
		
КонецПроцедуры


#КонецОбласти
